app/controllers/availabilities_controller.rb

  def index
    @availabilities = Availability.all
---
SELECT "availabilities".* FROM "availabilities"

  def create
    @availability = Availability.new(availability_params)

    respond_to do |format|
      if @availability.save
---
INSERT INTO "availabilities" ("localization", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["localization", "Estação"], ["start_time", "2019-12-16 10:00:00"], ["end_time", "2019-12-16 16:00:00"], ["created_at", "2019-12-15 16:18:03.336193"], ["updated_at", "2019-12-15 16:18:03.336193"]]

  def update
    respond_to do |format|
      if @availability.update(availability_params)
---
UPDATE "availabilities" SET "start_time" = $1, "end_time" = $2, "updated_at" = $3 WHERE "availabilities"."id" = $4  [["start_time", "2020-05-07 00:00:00"], ["end_time", "2020-05-07 23:00:00"], ["updated_at", "2020-05-07 23:15:20.622479"], ["id", 1]]

  def destroy
    @availability.destroy
---
DELETE FROM "availabilities" WHERE "availabilities"."id" = $1  [["id", 1]]

  def calendar
    @availabilities = Availability.all
    @meetings = Meeting.all
---
SELECT "availabilities".* FROM "availabilities"
SELECT "meetings".* FROM "meetings"

    def set_availability
      @availability = Availability.find(params[:id])
---
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]