app/controllers/meetings_controller.rb

SELECT "availabilities".* FROM "availabilities" WHERE (start_time >= '2019-12-16 00:00:00') AND (end_time <= '2019-12-16 00:00:00')
SELECT "availabilities".* FROM "availabilities" ORDER BY "availabilities"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "meetings" SET "start_time" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["start_time", "2019-12-16 00:00:00"], ["updated_at", "2019-12-15 19:16:38.695987"], ["id", 2]]
INSERT INTO "meetings" ("name", "localization", "phone", "start_time", "created_at", "updated_at", "products", "total_price", "payment_type", "information", "district", "position", "cep") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @meeting = Meeting.new(meeting_params)
    @availability = Availability.where("start_time <= ?", @meeting[:start_time])
                                .where("end_time >= ?", @meeting[:start_time])

    respond_to do |format|
      if @availability.present?
        @meeting.save

SELECT "availabilities".* FROM "availabilities" WHERE (start_time <= '2019-12-16 11:00:00') AND (end_time >= '2019-12-16 11:00:00')
SELECT "availabilities".* FROM "availabilities" ORDER BY "availabilities"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "meetings" SET "phone" = $1, "district" = $2, "updated_at" = $3 WHERE "meetings"."id" = $4  [["phone", "11995597242"], ["district", ""], ["updated_at", "2020-05-08 14:37:05.609570"], ["id", 2]]
---
  def update
    @availability = Availability.where("start_time <= ?", @meeting[:start_time])
                                .where("end_time >= ?", @meeting[:start_time])
    respond_to do |format|
      if @availability.present?
        @meeting.update(meeting_params)

DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 3]]
---
  def destroy
    @meeting.destroy

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "meetings" SET "message_sent" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["message_sent", false], ["updated_at", "2020-05-09 00:32:04.204068"], ["id", 2]]
---
  def toggle
    @meeting = Meeting.find(params[:id])

    if @meeting != nil?
      @meeting.update(message_sent: params[:bool])

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
INSERT INTO "meetings" ("name", "localization", "phone", "start_time", "created_at", "updated_at", "products", "total_price", "payment_type", "information", "district", "package_ready", "package_delivered", "position", "cep") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
UPDATE "meetings" SET "position" = ("meetings"."position" + 1), "updated_at" = '2020-05-20 16:16:24.458022' WHERE (1 = 1) AND ("meetings".id != 60) AND ("meetings"."position" >= 2) AND ("meetings"."position" < 53)
---
  def duplicate
    @meeting = Meeting.find(params[:id])

    respond_to do |format|
      if @meeting != nil?
        meeting_clone = @meeting.dup
        meeting_clone.save

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
UPDATE "meetings" SET "start_time" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["start_time", "2020-05-26 19:31:00"], ["updated_at", "2020-05-26 16:56:23.917704"], ["id", 123]]
---
  def start_time
    @meeting = Meeting.find(params[:id])
    if @meeting != nil?
      @meeting.update(start_time: DateTime.parse("#{@meeting.start_time.strftime("%Y-%m-%d")} #{params[:start_time]}"))

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 124], ["LIMIT", 1]]
---
    def set_meeting
      @meeting = Meeting.find(params[:id])