app/controllers/scheduler_controller.rb

  def show
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def show_delivers
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def clients_delivers
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"