app/controllers/schedulers_controller.rb

SELECT "meetings".* FROM "meetings"
---
  def show
    @meetings = Meeting.all

SELECT "meetings".* FROM "meetings"
---
  def show_delivers
    @meetings = Meeting.all

SELECT "meetings".* FROM "meetings"
---
  def clients_delivers
    @meetings = Meeting.all

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "meetings" SET "package_ready" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["package_ready", true], ["updated_at", "2020-05-19 00:42:18.267639"], ["id", 24]]
UPDATE "meetings" SET "package_delivered" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["package_delivered", true], ["updated_at", "2020-05-19 00:42:21.575030"], ["id", 24]]
---
  def toggle_scheduler
    @meeting = Meeting.find(params[:id])

    if @meeting != nil?
      if params[:field] == 'package_ready'
        @meeting.update(package_ready: params[:bool])
      elsif params[:field] == 'package_delivered'
        @meeting.update(package_delivered: params[:bool])